proyecto/proyecto2/Proyecto1/app/controllers/secciones/productos_controller.rb

  def index
    @productos = @seccion.productos.all
---
SELECT "productos".* FROM "productos" WHERE "productos"."seccion_id" = ?  [["seccion_id", 1]]

  def show
    @producto = @seccion.productos.find(params[:id])
---
SELECT "productos".* FROM "productos" WHERE "productos"."seccion_id" = ? AND "productos"."id" = ? LIMIT ?  [["seccion_id", 1], ["id", 1], ["LIMIT", 1]]

  def edit
    @producto = @seccion.productos.find(params[:id])
---
SELECT "productos".* FROM "productos" WHERE "productos"."seccion_id" = ? AND "productos"."id" = ? LIMIT ?  [["seccion_id", 1], ["id", 3], ["LIMIT", 1]]